БИТУправление_медицинским_центром_демо/src/Catalogs/ШаблоныHTML/ШаблоныHTML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныHTML</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекстHTML</name>
    <comment>Строка, содержащая HTML-шаблон для подстановки в поля HTML-документов программы</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШаблона</name>
    <type>
      <types>EnumRef.ВидыШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаетСЗубнойКартой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатаетсяБезПереходаНаНовуюСтраницу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличныйДокумент</name>
    <comment>Только для справок и прочих медосмотров</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьРазмерБумаги</name>
    <comment>Только для справок и прочих медосмотров</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьОриентацияСтраницы</name>
    <comment>Только для справок и прочих медосмотров</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьАвтомасштабирование</name>
    <comment>Только для справок и прочих медосмотров</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьДвусторонняяПечать</name>
    <comment>Только для справок и прочих медосмотров. Использовать настройки принтера(0), Нет(1), Переворот вверх(2), Переворот влево(3)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.РегистрируемыеЭлектронныеМедДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСЭМД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасположениеПодписи</name>
    <type>
      <types>Number</types>
      <types>EnumRef.РасположениеПодписи</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьШапкуШаблона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЭЦПТабличногоШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидМедицинскойДокументации</name>
    <type>
      <types>CatalogRef.ВидыМедицинскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФормироватьОтдельныйЭМД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьДиагнозыИзТабличнойЧасти</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствияПараметрам</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеМедосмотра</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>localid</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заполнять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлассификацияПоля</name>
      <type>
        <types>CatalogRef.ИнструментальныеИсследования</types>
        <types>CatalogRef.ЛабораторныеТесты</types>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующееПоле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъединяющееПоле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокИзображений</name>
    <attributes>
      <name>ИзображениеBase64</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияТаблицамШаблонов</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаШаблонов</name>
      <type>
        <types>CatalogRef.ТаблицыШаблоновПриема</types>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаОбработки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>localid</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлассификацияПоля</name>
      <type>
        <types>CatalogRef.ИнструментальныеИсследования</types>
        <types>CatalogRef.ЛабораторныеТесты</types>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующееПоле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонстантыCDAДокумента</name>
    <attributes>
      <name>localid</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующееПоле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлассификацияПоля</name>
      <type>
        <types>CatalogRef.ИнструментальныеИсследования</types>
        <types>CatalogRef.ЛабораторныеТесты</types>
        <types>CatalogRef.КлассификаторыМинЗдрава</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиПодписей</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиПриПодписиМедДокументов</types>
        <types>EnumRef.РолиПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимНастройкиДоступности</name>
      <type>
        <types>EnumRef.РежимыНастройкиДоступностиРоли</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакДоступностиРоли</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРоли</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/РасположениеПодписи/РасположениеПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РасположениеПодписи</name>
  <enumValues>
    <name>ПослеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПравыйВерхнийУгол</name>
  </enumValues>
  <enumValues>
    <name>ПравыйНижнийУгол</name>
  </enumValues>
  <enumValues>
    <name>ЛевыйВерхнийУгол</name>
  </enumValues>
  <enumValues>
    <name>ЛевыйНижнийУгол</name>
  </enumValues>
  <enumValues>
    <name>НеВыводить</name>
  </enumValues>
  <enumValues>
    <name>ПоЗаданнымКоординатам</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ШаблоныHTML/Forms/НастройкаЭЦПТабличногоДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТабличныйДокумент = Параметры.ТабличныйДокумент;
	РасположениеПодписи = Параметры.РасположениеПодписи;
	ПараметрыЭЦПТабличногоШаблона = Параметры.ПараметрыЭЦПТабличногоШаблона;
	
	ИмяРисункаЭЦП = ЭЦП_УМЦ_Сервер.ИмяРисункаЭЦПВТабличномДокументе();
	ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы;
	
	Если РасположениеПодписи = Перечисления.РасположениеПодписи.ПослеДокумента Тогда
		НомерПервойСтрокиПослеДокумента = ТабличныйДокумент.ВысотаТаблицы + 1;
		СтрокаПодДокументом = ТабличныйДокумент.Область(СтрШаблон("R%1", НомерПервойСтрокиПослеДокумента));
		СтрокаПодДокументом.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.БольшойПунктир);
	КонецЕсли;
	
	ЭЦП_УМЦ_Сервер.ДобавитьРисунокЭЦПВТабличныйДокумент(ТабличныйДокумент, ПараметрыЭЦПТабличногоШаблона, ПолучитьДанныеПодписи(), РасположениеПодписи, ВысотаТаблицы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Закрыть(ПараметрыЭЦПТабличногоШаблона);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	ПараметрыЭЦПТабличногоШаблона = "";
	ОбщегоНазначенияБИТКлиентСервер.УдалитьРисунокИзТабличногоДокумента(ТабличныйДокумент, ИмяРисункаЭЦП);
	ЭЦП_УМЦ_Сервер.ДобавитьРисунокЭЦПВТабличныйДокумент(ТабличныйДокумент, ПараметрыЭЦПТабличногоШаблона, ПолучитьДанныеПодписи(), РасположениеПодписи, ВысотаТаблицы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТабличныйДокументПриИзменении(Элемент)
	
	Если ТипЗнч(Элемент.ТекущаяОбласть) = Тип("РисунокТабличногоДокумента")
		И Элемент.ТекущаяОбласть.Имя = ИмяРисункаЭЦП
	Тогда
		ПараметрыЭЦПТабличногоШаблона = СохранитьИОбновитьРисунокЭЦП(ТабличныйДокумент, ИмяРисункаЭЦП, ПолучитьДанныеПодписи(), РасположениеПодписи, ПараметрыЭЦПТабличногоШаблона, НомерПервойСтрокиПослеДокумента, ВысотаТаблицы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПодписи()
	
	ДанныеПодписи = Новый Структура;
	ДанныеПодписи.Вставить("Сертификат",							"Серийный номер");
	ДанныеПодписи.Вставить("ВладелецСертификата",					"Данные владельца");
	ДанныеПодписи.Вставить("НаименованиеОрганизации",				"Наименование организации");
	ДанныеПодписи.Вставить("ДействительностьСертификатаНачало",		Формат(ТекущаяДата()-48*3600, "ДФ=dd.MM.yyyy"));
	ДанныеПодписи.Вставить("ДействительностьСертификатаОкончание",	Формат(ТекущаяДата()+48*3600, "ДФ=dd.MM.yyyy"));
	ДанныеПодписи.Вставить("ДатаПодписи",							Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
	
	Возврат ДанныеПодписи;
	
КонецФункции

&НаСервереБезКонтекста
Функция СохранитьИОбновитьРисунокЭЦП(ТабличныйДокумент, ИмяРисункаЭЦП, ДанныеПодписи, РасположениеПодписи, ПараметрыЭЦПТабличногоШаблона, НомерПервойСтрокиПослеДокумента, ВысотаТаблицы)
	
	НовыеПараметрыЭЦПТабличногоШаблона = СохранитьПараметрыРисункаЭЦП(ТабличныйДокумент, ИмяРисункаЭЦП, РасположениеПодписи, ПараметрыЭЦПТабличногоШаблона, НомерПервойСтрокиПослеДокумента);
	ОбщегоНазначенияБИТКлиентСервер.УдалитьРисунокИзТабличногоДокумента(ТабличныйДокумент, ИмяРисункаЭЦП);
	ЭЦП_УМЦ_Сервер.ДобавитьРисунокЭЦПВТабличныйДокумент(ТабличныйДокумент, НовыеПараметрыЭЦПТабличногоШаблона, ДанныеПодписи, РасположениеПодписи, ВысотаТаблицы);
	
	Возврат НовыеПараметрыЭЦПТабличногоШаблона;
	
КонецФункции

&НаСервереБезКонтекста
Функция СохранитьПараметрыРисункаЭЦП(ТабличныйДокумент, ИмяРисункаЭЦП, РасположениеПодписи, ПараметрыЭЦП, НомерПервойСтрокиПослеДокумента)
	
	Параметры = Новый Соответствие;
	Параметры.Вставить("Ширина",			НСтр(ПараметрыЭЦП, "Ширина"));
	// По координатам
	Параметры.Вставить("КоордВерх",			НСтр(ПараметрыЭЦП, "КоордВерх"));
	Параметры.Вставить("КоордЛево",			НСтр(ПараметрыЭЦП, "КоордЛево"));
	Параметры.Вставить("КоордРасположение",	НСтр(ПараметрыЭЦП, "КоордРасположение"));
	// После документа
	Параметры.Вставить("ПослеВерх",			НСтр(ПараметрыЭЦП, "ПослеВерх"));
	Параметры.Вставить("ПослеЛево",			НСтр(ПараметрыЭЦП, "ПослеЛево"));
	
	Если РасположениеПодписи = Перечисления.РасположениеПодписи.ПоЗаданнымКоординатам Тогда
		
		НомерПервойСтроки	= ПолучитьКрайОбласти(ТабличныйДокумент, ИмяРисункаЭЦП, СтрШаблон("R%1:R%2", "%1", ТабличныйДокумент.ВысотаТаблицы), -ТабличныйДокумент.ВысотаТаблицы);
		НомерПервойКолонки	= ПолучитьКрайОбласти(ТабличныйДокумент, ИмяРисункаЭЦП, СтрШаблон("R1C%1:R%2C%3", "%1", ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы), -ТабличныйДокумент.ШиринаТаблицы);
		
		НомерПервойСтроки = ?(НомерПервойСтроки = Неопределено, 1, НомерПервойСтроки);
		
		ОбластьСРисункомЭЦП = СтрШаблон("R%1C%2:R%3C%4", НомерПервойСтроки, НомерПервойКолонки, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);
		Для Каждого Рисунок Из ТабличныйДокумент.ПолучитьОбласть(ОбластьСРисункомЭЦП).Рисунки Цикл
			Если Рисунок.Имя = ИмяРисункаЭЦП Тогда
				ЯчейкаРисунка = СтрШаблон("R%1C%2", НомерПервойСтроки, НомерПервойКолонки);
				
				Параметры["КоордВерх"]			= ?(Рисунок.Верх < 0, 0, Рисунок.Верх);
				Параметры["КоордЛево"]			= Рисунок.Лево;
				Параметры["КоордРасположение"]	= ЯчейкаРисунка;
				Параметры["Ширина"]				= Рисунок.Ширина;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		РисунокПодДокументом = Ложь;
		
		ОбластьСРисункомЭЦП = СтрШаблон("R%1C1:R%2C%3", НомерПервойСтрокиПослеДокумента, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);
		Для Каждого Рисунок Из ТабличныйДокумент.ПолучитьОбласть(ОбластьСРисункомЭЦП).Рисунки Цикл
			Если Рисунок.Имя = ИмяРисункаЭЦП Тогда
				РисунокПодДокументом = Истина;
				
				Параметры["ПослеВерх"]			= ?(Рисунок.Верх < 0, 0, Рисунок.Верх);
				Параметры["ПослеЛево"]			= Рисунок.Лево;
				Параметры["Ширина"]				= Рисунок.Ширина;
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не РисунокПодДокументом Тогда
			ОпуститьРисунокПодДокумент(ТабличныйДокумент, ИмяРисункаЭЦП, Параметры);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СформироватьСтрокуПараметров(Параметры);
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьСтрокуПараметров(Параметры)
	
	мПараметры = Новый Массив;
	Для Каждого КлючЗначение Из Параметры Цикл
		мПараметры.Добавить(СтрШаблон("%1='%2'", КлючЗначение.Ключ, КлючЗначение.Значение));
	КонецЦикла;
	
	Возврат СтрСоединить(мПараметры, ";");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОпуститьРисунокПодДокумент(ТабличныйДокумент, ИмяРисункаЭЦП, Параметры)
	
	НомерПервойКолонки = ПолучитьКрайОбласти(ТабличныйДокумент, ИмяРисункаЭЦП, СтрШаблон("R1C%1:R%2C%3", "%1", ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы), -ТабличныйДокумент.ШиринаТаблицы);
	
	ОбластьСРисункомЭЦП = СтрШаблон("R1:R%1", ТабличныйДокумент.ВысотаТаблицы);
	Для Каждого Рисунок Из ТабличныйДокумент.ПолучитьОбласть(ОбластьСРисункомЭЦП).Рисунки Цикл
		Если Рисунок.Имя = ИмяРисункаЭЦП Тогда
			Параметры["ПослеВерх"]			= 0;
			Параметры["ПослеЛево"]			= Рисунок.Лево;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКрайОбласти(ТабличныйДокумент, ИмяРисункаЭЦП, ШаблонОбласти, НомерПервогоЭлемента)
	
	Для Номер = НомерПервогоЭлемента По -1 Цикл
		
		Область = ТабличныйДокумент.ПолучитьОбласть(СтрШаблон(ШаблонОбласти, -Номер));
		Для Каждого Рисунок Из Область.Рисунки Цикл
			Если Рисунок.Имя = ИмяРисункаЭЦП Тогда
				Возврат -Номер;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
